---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.OverallWidth
source: html/1202c1f6-df13-66a1-a097-8a0c30d5715e.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.OverallWidth Property

The length of the wire sheet (including overhangs) in the minor direction.

## Syntax (C#)
```csharp
public double OverallWidth { get; }
```